---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotCoordinateBase
source: html/3724bdfb-b1ee-7c63-d890-0b643dfb448a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotCoordinateBase Property

"Coordinate Base"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotCoordinateBase { get; }
```